[
  "Page 2 CONTENTS 1 How do you choose exercises? 6 What is proper lifting technique? 9 How should you warm up? 12 How heavy should you lift? 14 How long should you rest between sets? 18 How many sets should you do? 23 How hard should you train? 25 How often should you train? 29 How should you progress? 31 When and how should you deload? 33 How should you plan training phases? 37 Beginner vs. Intermediate vs. Advanced Training 41 How do you prioritize specific lifts? 43 Preventing and Managing Injuries 48 Matching Your Training to Your Diet 50 Troubleshooting Lack of Progress Copyright © 2023 Renaissance Periodization https:/ /rpstrength.com Page 3 STRENGTH TRAINING MADE SIMPLE 1 1. HOW DO YOU CHOOSE EXERCISES? The most important principle in strength training is specificity. You train the lifts you want to get strong at so that the practice of training them makes you stronger at those specific movements. For example, if you want to improve your shoulder pressing strength, doing plenty of shoulder pressing in your training is probably a good idea. That being said, you don’t only have to train the lifts you want to get stronger at by themselves. You can train other exercises that: ● Are of a similar movement pattern to your chosen lifts • An example of this would be supplementing your barbell shoulder pressing goals with a dumbbell shoulder press. ● Grow or make stronger certain muscles that contribute to the specific lift • An example of this would be incorporating overhead extensions to make your triceps bigger and stronger for improved shoulder press strength. ● Make portions of the movement stronger that contribute to the specific lift. • An example of this would be doing good mornings to get stronger in the squat since good mornings improve your ability to keep your back straight and upright when squatting. So when you find yourself wondering which exercises you should be using to achieve your goals, the first part of that answer will always be something to the extent of what- ever is specific to the exercise itself. Page 4 STRENGTH TRAINING MADE SIMPLE 2 1. How do you choose exercises This is the value of the principle of specificity. HOW DO YOU CHOOSE EXERCISES? Or, phrased slightly differently, the exercises you choose to feature in your training program can be the specific exercises you want to improve or exercises that train the muscles or sub-movements that can be known to be limiting factors to the performance of the primary exercise of focus. When we use the term limiting factors, we mean that if you improve a certain compo- nent of the exercise or muscles involved, then the exercise itself will improve. An easy example is training your grip to increase your deadlift ability. If your grip strength is, in fact, limiting your ability to deadlift more weight, improving your grip strength will improve your deadlift numbers right away. Page 5 STRENGTH TRAINING MADE SIMPLE 3 1. How do you choose exercises The second part of the answer to “what exercise should I choose” is simply whichever one has a higher SFR. SFR stands for stimulus to fatigue ratio. STIMULUS TO FATIGUE RATIO STIMULUS FATIGUE By stimulus, we mean an exercise that places a high degree of tension on the target muscles and is not needlessly demanding on the joints or fatiguing to the whole body as a system. Some exercises, like dips, can be a bit too unstable to place the highest possible ten- sion on the target muscles and are thus best saved for muscle growth and not strength training. Other exercises, like the half-squat for leg strength, impose a lot of stress on the spinal musculature (way more than deep squats do) but don’t have as powerful of an ability to impose tension on the leg muscles. Page 6 STRENGTH TRAINING MADE SIMPLE 4 1. How do you choose exercises Additionally, some exercises get very “grooved in” after a few sessions and are thus easy to train productively without second-guessing the movement pattern. For these exercises, we might say",
  "that they have a higher SFR than exercises that feel awkward even after you’ve learned to do them proficiently. Some exercises feel fine to begin with but beat up your joints and connective tissues too much, which increases overall fatigue too much and lowers the SFR. Lastly, some exercises, such as single-arm dumbbell preacher curls, are not very safe to load heavily, and thus have a poor SFR because the stimulus side (high tension) can never safely be presented over weeks of training. In light of all of these possibilities, what you will find is that choosing exercises that put a lot of tension on the target muscles, don’t beat up the joints and connective tissues too much, are comfortable to train week after week, are safe to load heavily, and don’t exhaust you entirely when you do them are the exercises with the highest SFRs and should be preferred when possible in your programming. While this is a wonderful consideration to keep in mind as a general rule, it doesn’t mean you need to do only a few exercises in perpetuity. With any exercise, repeated exposures over weeks and months can cause it to turn stale, which technically means its SFR is declining. You can choose which exercises to keep in your program by abiding by the following three guidelines: 1. Exercises that give you great tension and let you lift heavy relative loads naturally should be kept in most (if not all) cases. 2. Exercises that are easier on your joints and are worth systemic fatigue because they make you considerably stronger over time should be kept in most (if not all) cases. 3. Exercises that are steadily climbing in strength over months of training should be kept in most (if not all) cases. Conversely, you should consider replacing any exercises that: 1. Are no longer “grooving” and leave you feeling as though you’re failing to generate super high forces in the right direction. 2. Are getting tough on your joints and zap your strength for the rest of your session upon completion. 3. Have plateaued in strength over the last month or so of your training. Page 7 STRENGTH TRAINING MADE SIMPLE 5 1. How do you choose exercises QUALIT Y TENSION, LOW JOINT FATIGUE, STEADY PROGRESSIO N STIMULUS DISP LACED TENSION, HIGH FAT IGUE, HALTED PROG RESSIO N FATIGUE We’ll cover this more in-depth later, but there is also a timing component to exercise selection. In the beginning of a macrocycle (a whole plan of strength training that ends in the testing of your 1RM), you might do mostly exercises that train subsystems and not the direct lift itself. For example, you might train lots of hack squats early in a squat-focused macrocycle to develop quad strength while doing minimal or even no squatting at all. Yet, as you near your 1RM testing day, you might do fewer subsystem exercises (otherwise known as “accessory” or “assistance” movements) and do lifts that mimic your 1RM lift more and more such as high-bar squats and eventually the very low-bar squats you’ll be testing at the end. Page 8 STRENGTH TRAINING MADE SIMPLE 6 2. WHAT IS PROPER LIFTING TECHNIQUE? Proper technique in lifting for strength has at least six unifying components, which are that the technique: 1. Utilizes the most muscle possible to generate the most force. • Another implication of this first point is that the technique is performed in positions in which the muscles are their strongest. • For example, the sternal portion of the pectoralis muscles is bigger and stronger than the clavicular portion, so arching the back in the bench press is a better technique for strength because it allows the sternal pecs to con- tribute more force to moving the bar. Page 9 STRENGTH TRAINING MADE SIMPLE 7 2. What is proper lifting technique PROPER LIFTING TECHNIQUE Utilizes the most muscle possible to generate the most force. 2. Utilizes the leverage of the lift to move the highest loads. • For example, a low-bar squat positions the bar closer to your center of gravity and thus requires less knee flexion at the",
  "bottom of the lift, which creates a shorter moment arm for the torso. In turn, this maximizes the potential to lift the heaviest weights. • Another example is that good deadlift technique requires you to keep the bar as close to your legs as possible on the ascent so that the moment arm of the torso is at its lowest and higher loads can be lifted. 3. Is not needlessly fatiguing, damaging, or unsafe in the short and long term. • For example, dive-bombing your squats can allow you to lift more, but it also magnifies injury risk substantially and makes the squat less sustainable. Page 10 STRENGTH TRAINING MADE SIMPLE 8 2. What is proper lifting technique • “Candy-cane rounding” of your lower back in the deadlift might expose the spine to deleterious forces in its most vulnerable positions and may also not be a very sustainable practice. • Trying to bench press heavy with your legs up in the air can destabilize the lift and cause mis-grooves of bar position that lead to injury. 4. Can be replicated session to session for tracking. • The more you practice the same technique, the stronger you get at it. • You should be able to remember exactly where you put your hands, hips, feet, head, etc., so you can do the lift nearly identically each time you train it. 5. Is braced and stable. • Good technique nearly always features a super tight core that is achieved through proper bracing. • Good technique should also feature super stable feet, shoulders, and hands. For example, this could mean creating a stable shoulder shelf by moving your scapulae back in a movement like the squat. Using sturdy shoes and chalk to make sure maximum force transfer can occur is also a good idea. 6. Meets the competitive requirements of the lift. • Target lift technique must meet competition standards/rules if you’re inter- ested in competing. For example, if you’d like to powerlift someday, you should be squatting to below parallel by default. Doing anything else from a technique perspective simply doesn’t make any sense in this case due to the specificity of the goal. • On the other hand, assistance lift technique: – Must challenge the muscle or movements being targeted. ▪ Example 1: For muscle growth work to improve strength, the chosen technique should impose a high range of motion (ROM) and tension on the target muscle ▪ Example 2: For sub-movement strength work, a proper ROM should be used to challenge the sub-movement. For example, creating a deep enough deficit in the deficit deadlift would be a sensible train- ing idea for anyone who struggles to move the weight from the floor in the competition deadlift. Page 11 STRENGTH TRAINING MADE SIMPLE 9 3. HOW SHOULD YOU WARM UP? Before we address the how of warming up, let’s chat about the why. Specifically, what does warming up do for you? As it turns out, warming up achieves a few very beneficial things. It makes the heavy lifting done after it less likely to cause injury by warming up the tissue and practicing the lift in a safe movement path. Secondly, it makes your technique more efficient and lets you lift greater loads, which gives you a bigger stimulus and causes more strength increases. Lastly, it fires up your nervous system and lets you lift heavier loads, similarly giving you a bigger stimulus that makes you stronger. Here are some implications for how you can warm up in practice: 1. You can choose to do easy cardio for 5-10 minutes. This is optional. 2. Begin with a 20RM+ weight for the first exercise and do it for around 10 reps. 3. Do at least one weight halfway between your 20RM+ weight and your planned working weight for a set of five reps or so. The heavier the lift, the more sets of 8,6,4, etc. you might need to do. ● 0-50 pounds: 1 intermediate set ● 50-200 pounds: 2 intermediate sets ● 200-400 pounds: 3 intermediate sets ● Continue this trend as needed for bigger weights. Page 12 STRENGTH TRAINING MADE SIMPLE 10 3. How should you warm up 4. Do the working weight itself or 90% of it for",
  "1-2 reps. This is generally the last warm up set before the first working set and is also referred to as the potentia- tion set because it potentiates your nervous system to produce its highest output and lets you use most/all of your strength on the upcoming working set. When warming up, you should aim to execute the exact lifting technique (bracing and all) for every single warm up rep, even if it looks silly. As the saying goes, practice like you play! As you progress through your training session, the above-described warm up protocol can be shortened a bit if the next lift is for a similar movement pattern. Here’s an example of how you might warm up to doing squats for sets of five: ● Warm Up Set 1: 45 pounds for 10 reps ● Warm Up Set 2: 135 pounds for 6 reps ● Warm Up Set 3: 225 pounds for 4 reps ● Warm Up Set 4: 275 pounds for 2 reps ● Potentiation Set: 300 pounds for 1 rep ● Then you would begin your working sets of 5 reps at 300 pounds. Page 13 STRENGTH TRAINING MADE SIMPLE 11 3. How should you warm up 45 LBS FOR 10 REPS WORKING SETS AT 300 LBS CHOOSE GRAIN AND HEALTHY FAT OPTIONS SQUATS WITH A WORKIN G WEIGHT OF 300 POUND S 135 LBS FOR 6 REPS 225 LBS FOR 4 REPS 275 LBS FOR 2 REPS 300 LBS FOR 1 REP 1-2 MINUTE REST BETWEEN WARMUPS Later, if you were to do front squats for 5’s at 250lbs after your squatting at 300lbs, you might truncate your front squat warm up to the following: ● Warm Up Set 1: 135 pounds for 5 reps ● Warm Up Set 2: 225 pounds for 3 reps ● Warm Up Set 3: 250 pounds for 1 rep ● Then you would begin your working sets at 250 pounds. Page 14 STRENGTH TRAINING MADE SIMPLE 12 4. HOW HEAVY SHOULD YOU LIFT? From a large combination of scientific research and practical insight, we can be relatively certain that strength training is best done at a certain percentage of your 1RM, otherwise known as a “loading range” or “relative intensity.” From this combination of research and practice, we know that lifting anything less than 80% of your 1RM can improve your strength but won’t be very efficient per working set. In other words, you’d have to do a lot of lighter sets to get as strong as just a few heavy sets could make you at a fraction of time investment and fatigue cost. Such lighter training can cause lots of muscle growth but isn’t heavy enough to cause the best strength gains via nervous system adaptations. On the other hand, lifting anything over 92.5%+ of your 1RM also improves strength but not very efficiently per working set. In this case, you’d need a ton of sets to cause a lot of strength improvement. That’s not just a poor use of time, but it also would likely cause lots more joint and connective tissue fatigue and even increase your risk of acute injury. Such ultra-heavy training is essential for proper peaking of strength before a competition but not ideal for its core development. We can develop some rational loading recommendations by taking all of this under advisement. Page 15 STRENGTH TRAINING MADE SIMPLE 13 4. How heavy should you lift RATIONAL LOADING RECOMMENDATIONS 1. Anything in the 80-92.5% range of your 1RM will cause great strength gains, which typically means doing challenging sets of roughly 3-6 reps. • This doesn’t mean you have to do exactly 80-92.5%. People are different! The key is to find your challenging loads for sets of 3-6 reps because that’s likely where you’ll build the most strength. • Keep in mind too that you might need a bit more or less than 80-92.5% 1RM to challenge yourself with sets of 3-6 reps. 2. Some assistance work is best suited toward slightly higher reps such as sets of 5-8 reps, especially if the exercises are sin- gle-joint moves such as skull crushers or lateral raises. • This is for direct strength training because growing muscle for eventual strength development is best done with sets of 5-10 reps. We’ll explore that in more depth later on. To keep things super simple, follow these guidelines to adjust your loads: ● If you can do easy sets of 7+ reps,",
  "it’s too light. ● If you can’t do a few sets of at least 3 reps in a row, it’s too heavy. That’s it! Page 16 STRENGTH TRAINING MADE SIMPLE 14 5. HOW LONG SHOULD YOU REST BETWEEN SETS? Okay, so now you know how heavy to go for each working set. But how many reps you can get in each set is hugely based on how long you rest between each set and the next, which begs the question: Is there a correct amount of time to rest between sets? Yes, there is! After a given working set, you should rest long enough until you can at least check the following boxes for yourself: 1. Your prime movers are no longer burning, crampy, or drained. 2. Your cardio will not be the limiting factor in your next set. 3. Your nervous system/psychology will not be the limiting factor on your next set. • In other words, you feel strong enough to hit your target reps with the given load. 4. No synergists will be the limiting factor on your next set. Page 17 STRENGTH TRAINING MADE SIMPLE 15 5. How long should you rest between sets NO HOW LONG SHOULD YOU REST? REST ARE YOUR PRIME MOVERS RECOVERED? NO NO NO YES READY TO GO! IS YOUR BREATHING BACK TO NORMAL? DO YOU FEEL STRONG ENOUGH TO PERFORM WELL? ARE OTHER ASSISTANCE MUSCLE GROUPS RECOVERED? YES YES YES Because your performance on each working set determines how much of a strength stimulus you’ll benefit from, You can always tell the competitive weightlifters and powerlifters apart from everyone else at the gym because they rest so much longer than they actually lift. Page 18 STRENGTH TRAINING MADE SIMPLE 16 5. How long should you rest between sets Let’s see how this checklist system would play out with an example of you doing sets of five at 500 pounds if your rough 1RM were around 585 pounds. 1. Your prime movers are no longer burning, crampy, or drained. • 60 seconds 2. Your cardio will not limit you on the next set. • Two minutes 3. Your nervous system/psychology will not limit you on the next set. • Five minutes 4. No synergists will limit you on the next set. • 60 seconds In this case, because your nervous system and psychology needed five minutes, that’s how long you should take to rest at minimum, no matter how long the other factors took to satisfy. Now, let’s see how much rest you’d need if you lifted 350 pounds for sets of five instead of 500 pounds if you had the same strength. 1. Your prime movers are no longer burning, crampy, or drained. • 45 seconds 2. Your cardio will not limit you on the next set. • 90 seconds 3. Your nervous system/psychology will not limit you on the next set. • 60 seconds 4. No synergists will limit you on the next set. • 45 seconds Page 19 STRENGTH TRAINING MADE SIMPLE 17 5. How long should you rest between sets The result is 90 seconds, which doesn’t mean you have to do another set again as soon as that time elapses. Rather, it means that you should rest at least 90 seconds. If you have a limited amount of time in the gym that day, resting the 90-second minimum might be what’s required to move through your session at an appropriate pace to finish. But, if you’re not battling the clock, you might choose to rest two (or even three) minutes between sets simply to make the session feel less rushed. Page 20 STRENGTH TRAINING MADE SIMPLE 18 6. HOW MANY SETS SHOULD YOU DO? To answer this question, you have to answer it in two ways. The first way to answer this question is to consider how many sets you should do per movement type (like a squat, a hinge, or a press) per session. The second way to answer this question is to consider how many total working sets you should do per session, which includes all movement types in that session combined. Let’s answer them one at a time. HOW MANY SETS TO TRAIN PER MOVEMENT When training a given movement in a given session, you need to do enough sets of it to drive best strength adaptations, which means at least one heavy working set per session. In addition, the number of sets you do in your last week of a progression before taking a",
  "week-long break to recover (known as a deload) should be close to the most work that you can recover from and benefit from, because any less would be a missed opportunity in most cases. Thus, if you could have benefitted from five sets of squats but you only did four, you left some strength on the table. You do want to push the limits, but not exceed them. If you do so many sets in a session that the last set fails to perform highly enough to meet minimum force requirements, that last set was a set too far. So, how do you know if you’re underperforming? Page 21 STRENGTH TRAINING MADE SIMPLE 19 6. How many sets should you do Here’s a quick reference guide for the three different types of training you’ll do in an advanced strength training program: For hypertrophy for strength development, you know that you are underperforming when you can’t do sets of 5 to 10 with at least about 75% of your 1RM. For basic strength development, you know you are underperforming when you can’t do sets of 3 to 6 with at least 82.5% of your 1RM. For limit strength development, you know that you are underper- forming when you can’t do sets of 1 to 3 with at least about 87.5% of your 1RM. HYPERTROPHY FOR STRENGTH BASIC STRENGTH LIMIT STRENGTH 5-10 reps with at least 75% 1RM 3-6 reps with at least 82.5% 1RM 1-3 reps with at least 87.5% 1RM LOADING STANDARDS FOR STRENGTH TRAINING In essence, if you fail to perform to those minimum standards, you’re so fatigued that you’re moving weight around without stimulating much of anything. This sort of junk volume is going to accumulate to result in tons of fatigue but very little improvement and is something you should actively avoid. Page 22 STRENGTH TRAINING MADE SIMPLE 20 6. How many sets should you do In essence, if you fail to perform to those minimum standards, you’re so fatigued that you’re moving weight around without stimulating much of anything. This sort of junk volume is going to accumulate to result in tons of fatigue but very little improvement and is something you should actively avoid. You’ve also done too much work in a given session if you cannot recover to perform better in the next week’s concomitant session. For example, if you hit a PR of 230 pounds for a top set of five reps last week and then did lots of other work sets after, you had better not have done so many sets after that next week you’re too fatigued to do at least something like 235 pounds for a top set of five reps. Because if you’re getting so tired that you literally cannot progress in strength, how in the world are you going to, well, progress in strength?! Often but not always, another sign that you might be doing too much volume is that you’re still sore in the muscles you trained last time by the next time you are scheduled to train them again. For example, if you have a squat and SLDL session on Monday and a deadlift and hack squat session on Thursday but you’re still sore in your lower back and quads by Thursday, you’re probably doing too much on Monday. Strength training is about going hard in the gym and coming back recovered enough to go even harder next time. It’s not just about “leaving it all on the gym floor” every time. In fact, many would consider that a well-intentioned but careless beginner mistake. To keep it simpler, we could refine these ideas down to the following points: 1. If you’re not training very close to your heaviest, it’s not going to make you much stronger. 2. If you’re training so much that you can’t hit a PR in the next week, you’re training too much. 3. If you’re training so much that you’re still sore by the next session, you’re training too much. 4. If you deload when you could have set another PR in the next week, you should be training with more sets per session or longer accumulation phases. Page 23 STRENGTH TRAINING MADE SIMPLE 21 6. How many sets should you do Lastly, remember that per-movement volume includes sets from all exercises of a given movement pattern. So if you have three",
  "sets of bench presses and three sets of incline dumbbell presses, that’s six sets for the pressing movement, not just three. Be sure to keep that in mind as you do your best to make sense of specific volume numbers as they relate to your ability to recover and progress effectively across your training cycle. HOW MANY SETS TO TRAIN PER SESSION Now that per-movement volume is sorted, how many sets in total should you be doing per session? First, if any of the exercises fall much below the 75%, 82.5% or 87.5% lines for their respective 1RM zones, it’s probably best practice to discontinue that session since doing anything more than that is likely junk volume (even if it feels heavy). It can feel heavy just because you’re tired, not because it’s challenging your body to get stronger. For example, if you can’t hit a set of three with more than 82.5% of your fresh 1RM for an exercise, you’re probably very fatigued and should shut the session down. The implication here is that you can only do so much work in a given strength training session before you’re too tired to continue being productive. Typically, this results in some common numbers for most people to expect to come close to as they near their capabilities. For most lifters, between 2 and 5 sets per movement type per session seems to work best. And, much more than 15 heavy work sets in a total session drops most below the minimum loading thresholds and is thus excessive. Page 24 STRENGTH TRAINING MADE SIMPLE 22 6. How many sets should you do SETS PER MOVEMENT TYPE: SETS PER SESSION: 2-5 SETS <15 SETS PRODUCTIVE SETS PER SESSION Page 25 STRENGTH TRAINING MADE SIMPLE 23 7. HOW HARD SHOULD YOU TRAIN? For many, it can be difficult to understand what exactly “hard” means in the context of strength training. When we use the term, we are suggesting that hard training means training close to your maximum abilities if you were to push each set to your absolute limits. But, what does the research say? Generally, it suggests that going all out shows no clear benefit over going very hard with some force in reserve. Going all out (which is here defined as giving a maximum effort on every set) all the time causes a lot of fatigue accumulation, which can prevent you from stringing together as many great workouts in a row as you could. On the other hand, training very far from your limits causes very poor gains. So the question then becomes the following: How can you make sure you give hard, but not excessive effort to each working set? For this question, we find it most helpful to use the Rating of Perceived Exertion, or RPE scale, which states the following: RPE 7 = “That was tough, but I very comfortably hit the goal weight and reps.” RPE 8 = “That was very tough, but I had no problem hitting the goal weight and reps.” RPE 9 = “That was super tough and a real struggle to hit the goal weight and reps.” RPE 10 = “If there was so much as one extra pound on the bar, I would have missed my goal weight and reps no matter how hard I tried.” Page 26 STRENGTH TRAINING MADE SIMPLE 24 7. How hard should you train EXPERIENCING RPE RPE RPE 7 EXPERIENCE Tough, but comfortably hit weight and reps RPE 8 Very tough, but no problem hitting weight and reps RPE 9 Super tough and a struggle hitting weight and reps RPE 10 Maximal eﬀort, no more room for any weight addition The RPE scale lets you approach your relative efforts with a logical structure. In most cases, something similar to the following example will prove beneficial for most lifters. 1. Start most accumulation phases (1-2 months of systematic progres- sions in both load and effort before a deload week) at your best estimate of RPE 7 and write down your weight and reps. 2. Add weight each week while trying to match reps from last week. • Week 1: 100 lbs for 5, 5, 5 (RPE 7-ish) • Week 2: 105 lbs for 5, 5, 5 (RPE 8-ish) • Week 3: 110 lbs for 5, 5, 5 (RPE 9-ish) • Week 4: 115 lbs for 5, 5, 5 (RPE 10-ish) 3. Sooner or later, you will hit failure and",
  "not be able to get your target reps. At that point it will be time to take a break and restart the process stronger than you were when you began the first phase. • Week 5: 120lbs for 5, 5, 4 (last set of 5 a miss at RPE 10) • Week 6: Deload training to recover and prepare for a second training cycle. Page 27 STRENGTH TRAINING MADE SIMPLE 25 8. HOW OFTEN SHOULD YOU TRAIN? Similar to the section on volume, we have to answer this question both for each move- ment type and for the total number of training sessions in the week. As a bit of a recap, remember that movement type refers to broader interpretations of human movement patterns such as a squatting motion, a hinging motion, a pressing motion, or a pulling motion. Generally, you can train the same movement type again later in the week when you can add load to the bar and successfully complete your target reps. This is also done best when the muscles involved have healed from last time’s imposed soreness. How often that is depends on how hard you train each session. Page 28 STRENGTH TRAINING MADE SIMPLE 26 8. How often should you train TIME PERFORMANCE STIMULUS ADAPTATION RECOVERY HOMEOSTATIC DISRUPTION TRAIN AGAIN HERE HOW OFTEN SHOULD YOU TRAIN? For example, if you do three sets per session, this might mean four sessions per week. But if you do four sets per session, this might mean three sessions per week. In most cases, anything under 2-4 sets per session might best be combined into fewer sessions since it’s just not worth the time and fatigue of warming up that many times per week. On the other hand, most movement types of more than 8 sets per session should be split up to increase the amount of weight lifted in your average set and thus increase the strength stimulus. Most often, the result is that a per-movement frequency of 2-4x per muscle per week is great depending on individual recovery rates and how demanding each session is. Higher frequencies are possible in some cases, but they should be done for limited periods of time due to the risk of unsustainability over months of training. Page 29 STRENGTH TRAINING MADE SIMPLE 27 8. How often should you train The total number of sessions per week that can be done hinges first and foremost on adherence. To help you make sense of your own training frequency, utilize this guide based on training age. For the purposes of this guide, we consider beginners as people who have trained for strength for 0-3 years, intermediates as those who have trained for 3-7 years, and advanced athletes as those who have been training for more than seven years. TRAINING FREQUENCY RECOMMENDATIONS FOR BEGINNER, INTERMEDIATE, AND ADVANCED ATHLETES Beginners: 2-4 total sessions per week The most important thing to consider with beginners is that you don’t want to burn them out in the process. In fact, you want to ignite desire for more! Additionally, nearly all beginners will make incredible progress on very low frequencies. And in most cases, full body training splits will be featured on these lower frequencies. Intermediates: 3-6 total sessions per week Intermediates are unlikely to burn out because they’ve already proven to love the training process. At this point, they need more sessions to do each movement justice. This is where more complicated splits like push/pull/legs, upper/lower, etc. become more common. Page 30 STRENGTH TRAINING MADE SIMPLE 28 8. How often should you train Advanced: 5-10 total sessions per week For advanced athletes, each movement needs to be first in its session at least once a week to improve as optimally as possible. In fact, training only one or two movements per session is very common as much more can often lead into junk volume territory. Additionally, emphasis and de-emphasis can be employed for those who can only train 5-6 days per week. This means that such lifters might focus on squats and deadlifts for a few months while bench pressing stays at maintenance (done last in sessions and with only enough volume",
  "and load to maintain performance but not improve it), and then switch later to emphasizing squats and benches while dead- lifting stays at maintenance. Finally, twice-daily sessions can take you up to 10 sessions per week total if desired, but this is almost reserved for competitors or those who might consider themselves “hardcore.” Page 31 STRENGTH TRAINING MADE SIMPLE 29 9. HOW SHOULD YOU PROGRESS? When you begin an accumulation phase in any given mesocycle, you need to choose a weight for each exercise in its target rep range, which is generally: ● 5-10 for strength-focused hypertrophy mesocycles ● 3-6 for basic strength mesocycles ● 1-3 for limit strength/peaking mesocycles From here, the idea is to program enough sets for each movement type so that you estimate that you’ll reach your maximum ability to recover (your maximum recoverable volume or MRV) at the end of the accumulation phase. This, however, is certainly a skill to be developed, so simply make your best guess to start. After a few mesocycles, you’ll know your body well enough to make increasingly educated estimations of your MRV. If you’re very unsure, it’s better to be conservative and err on the side of underestimating your MRV rather than overestimating your MRV. Once you’ve estimated your MRV and written out your programming accordingly, it’s time to start lifting and progressing. As we mentioned before, it’s probably best practice to start your accumulation phases with weights that land you in your target rep range at an RPE 7 for the first week. Page 32 STRENGTH TRAINING MADE SIMPLE 30 9. How should you progress Write down your weight and reps for each set in every session. Then, for your second week of training, come back and add enough weight to keep the RPE the same or raise it by one. For example: ● Week 1: 100 pounds for 5 reps at RPE 7 ● Week 2: 110 pounds for for 5 reps at RPE 8 A hard rule here is that your next week needs to beat your performance from last week. Beating your performance, in this case, could mean improving it by a small margin at the same RPE or by more but only as much as 1 RPE higher. In other words, don’t make an aggressive jump from RPE 7 to RPE 10 in a single week! If you get to your last week of training before you deload and you’re completely fatigued to the extent that there is no way you can hit another PR next week, that’s great! You’re right around your MRV and your volume estimations are on point. On the other hand, if you feel like you can probably PR again (even if only by a little) next week because you’re just not that fatigued, deload anyway but raise the average volume (number of sets for that movement type) in your next mesocycle by a set and repeat this process. Page 33 STRENGTH TRAINING MADE SIMPLE 31 10. WHEN AND HOW SHOULD YOU DELOAD? As you add weight and potentially sets to your sessions from week to week, you will inevitably reach the point of being unable to beat your performance from the week prior. When this happens, you will need to respond with some form of implemented recovery protocol. If this happens to just one of the movement patterns you have in your program but not the others, you can simply deploy a recovery session. Here’s how to do that: 1. Finish the session strong. 2. In the next planned session for that movement and muscle group, do all the planned sets at the planned reps but at half of the planned weight. • For example, if you were supposed to bench press 240 pounds for 9, 8, 7, 6, you would bench press 120 pounds for 9, 8, 7, 6 instead. 3. Resume the sessions in the week after at the same number of planned sets and keep progressing as you were in weight. • If we keep the same example from our second point, this means the week following your recovery session would be the time to attempt 240 pounds for 9, 8, 7, 6. 4. Add weight from there as you normally would. Page 34 STRENGTH TRAINING MADE SIMPLE 32 10. When and how should you deload Recovery sessions like this can buy you another",
  "week or two of progression by reducing your fatigue. It’s certainly an effective strategy, but it will only carry you so far since the fatigue from your other movements will still be accumulating all the while. At some point, after about 3-6 weeks of training in most cases, several of your trained movement patterns will require recovery sessions. And eventually, your entire mind and body will feel beat up, your per-session RPEs will be crazy high, and you will begin to underperform (fail to beat last week’s numbers) on nearly all of your movements at the same time. As you approach these colliding levels of fatigue, you will need to bring both your sys- temic and localized fatigue back down significantly by deloading. To deload, do the following for one whole week: 1. In the first half of the week, do the same number of sets and reps as the week before but at only 70% of last week’s weight. 2. In the second half of the week, do the same number of sets and reps as the week before, but at only 50% of last week’s weight. This should clear enough fatigue to allow you to train hard for another whole mesocycle. After your deload week, follow instructions from section nine of this guide and begin climbing your way up to higher training volumes once again. Page 35 STRENGTH TRAINING MADE SIMPLE 33 11. HOW SHOULD YOU PLAN TRAINING PHASES? As we’ve already demonstrated, productive training happens best by making each suc- cessive week systematically harder. And, when you can string multiple weeks of productive training together, this is called an accumulation phase. As we just learned, a deload week is what you deploy to drop the fatigue that accumu- lates during your accumulation phase, and the two together (an accumulation phase plus a deload week) make up what we refer to as a mesocycle. As we move up the timescale, anywhere from 1-3 mesocycles of the same kind of train- ing add up to what we call a block of training. At this point in the guide, we’ve already alluded to there being 3 primary types of training blocks, but now is the time to discuss them in a more explicit, detailed format. 3 SPECIFIC KINDS OF TRAINING HYPERTROPHY FOR STRENGTH PURPOSES ● This kind of training is accomplished through sets of 5-10 reps. ● These should be exercises that grow the most muscle but also convert well to strength moves. ● This kind of training allows for slightly higher training volumes. Page 36 STRENGTH TRAINING MADE SIMPLE 34 11. How should you plan training phases BASIC STRENGTH ● Basic strength training should be accomplished through sets of 3-6 reps. ● These should be exercises that increase strength the most and are very similar to (or the same as) competition/goal exercises. ● This kind of training allows for normal strength training volumes as discussed in earlier sections of this guide. PEAKING ● This kind of training is accomplished through sets of 1-3 reps. ● Sets of 3-6 reps at RPEs of 3-6 can also be done for technique work between hard sessions. ● In terms of exercise selection, these should be mostly if not exclusively competition exercises. ● When peaking, intensities should range from RPE 7 to RPE 9. ● In the final week of peaking, RPEs should range from 3-6. ● Volume in a peaking phase declines during most weeks. Essentially, during a peaking phase, your volume progresses from normal strength volumes to no training at all as you prepare to max out and set a new PR. SEQUENCING TRAINING BLOCKS Most strength training macrocycles are sequenced as follows: a hypertrophy block, then a strength block, then a peaking block. They are ordered like this because of the principle of phase potentiation , which is the idea that, for best long-term performances, certain training qualities need to be Page 37 STRENGTH TRAINING MADE SIMPLE 35 11. How should you plan training phases developed ahead of others since the latter qualities are based on the former. The former qualities potentiate, or improve, the end result of the latter qualities. In",
  "strength training, we potentiate strength phases with hypertrophy phases because, if you build more muscle first, you have more muscle to make stronger. Then, the peaking phase follows the strength phase because it doesn’t make any sense to peak your strength if you haven’t dedicated yourself to a season of improving your strength in the first place. By analogy, the hypertrophy phase is like the underground foundation of a skyscraper, the strength phase is like the main floors, and the peaking phase is like the spire at the top. To build the tallest skyscraper you can, you need to focus on building a sturdy base to support the main floors to come. If you fail to build a solid base, not as many main floors can be built above ground with stability. Once you have the main floors on top of the base, only then do you add the spire on top. A spire placed on ground level doesn’t make for a very impressive structure. Without a spire, the skyscraper is primarily made up of its main floors. It might be relatively tall and impressive, but it will never be as grand and awe-inspiring as would be with a spire. In strength training terms, phase potentiation looks like this: 1. Put on muscle through the use of a hypertrophy block. 2. Make that new muscle stronger through the use of a basic strength block. 3. Peak for max performance through the use of a peaking block. 4. Compete or max out at the gym. 5. Take an active rest phase, which is essentially 1-2 weeks of super easy training or even no formal training at all to heal both physically and psychologically for the next macrocycle of training. 6. And then repeat! Page 38 STRENGTH TRAINING MADE SIMPLE 36 11. How should you plan training phases TIME (WEEKS) 4 8 12 16 20 24 280 HYPERTROPHY MESO 1 MESO 2 MESO 3 BASIC STRENGTH PEAKING MESO 4 MESO 5 MESO 6 ACTIVE REST PHASE POTENTIATION MACROCYCLE To get the best results from this process, each block should usually have 2-3 hypertrophy and 2-3 strength phases in a row but usually just one peaking phase in the peaking block. If you’re not yet ready or interested in competition, you don’t have to peak if you don’t want to. You can just do hypertrophy and strength blocks back to back with an active rest on occasion to get amazing long-term strength gains. After all, you can always incorporate a peaking phase if you decide you’re ready to enter into the competitive realm of strength sport. Page 39 STRENGTH TRAINING MADE SIMPLE 37 12. BEGINNER VS. INTERMEDIATE VS. ADVANCED TRAINING Different training approaches can change based on your level of advancement in lifting. The key is to figure out which category applies to you. Beginner ● You just lift and you keep getting stronger automatically without much complexity. ● You get stronger every single mesocycle of training. ● You’re most likely to have lifted for 0-3 years, though if the above two points apply to you, you’re still a beginner even more than 3 years into your lifting career. Intermediate ● You’ve hit your first plateau and had to navigate around it. ● You need to nail the basics consistently to keep progressing. ● You get a little stronger in most mesocycles of training, but, on occasion, you have a mesocycle or two where no clear evidence of strength gain is present, especially during hypertrophy blocks. ● You’re most likely to have lifted for 3-7 years, though it could be less or more. Page 40 STRENGTH TRAINING MADE SIMPLE 38 12. Beginner vs. Intermediate vs. Advanced Training Advanced ● If your sleep, recovery, nutrition, and training isn’t meticulous and well-planned, you simply don’t make strength gains. ● You actually temporarily decline in predicted 1RM strength during hypertrophy blocks, regain the lost strength early on in strength mesocycles, gain perhaps a little bit of predicted strength in your last strength mesocycle of the strength block, and make most of your apparent gains in your peaking phase. ● You’re most likely to have lifted for 7+ years, though it could be less or",
  "more. If you’re not sure which one you are, choose the less experienced of your two best choices and go from there. Once you’ve made your choice, or, if you train other individuals who are of a certain advancement in their training age, you can incorporate some of the following training recommendations for each level: Beginner athletes should: 1. Do mostly sets of 5-10 reps. 2. Focus mostly on the compound basics or just a few basic exercises. 3. Focus tons on improving and solidifying their technique. 4. Avoid training at RPE 10 as the technique breakdown here can cause the accidental learning of bad technique. 5. Avoid near-MRV volumes. 6. Train full-body 3-4x per week. Page 41 STRENGTH TRAINING MADE SIMPLE 39 12. Beginner vs. Intermediate vs. Advanced Training Intermediate athletes should: 1. Do mostly sets of 5-10 and sets of 3-6 while peaking with sets of 1-3 (but not peaking too often). 2. Try lots of different exercises to see which SFRs are best for them. 3. Focus on altering their basic techniques to fit their personal SFRs. 4. Push from RPE 7-10 in most mesocycles while focusing on breaking barriers toward the end of each mesocycles. 5. Train from MEV to MRV in most mesocycles. 6. Train each movement type 2-4x per week across 4-6 total sessions. Advanced athletes should: 1. Do mostly sets of 3-6 while only utilizing sets of 5-10 when needing to reclaim size or move up a weight class. 2. Focus mostly on the best SFR exercises for them. • Advanced athletes should vary their rep ranges and move- ments to manage fatigue within the week. 3. Perform most of their training between RPE 8-9. • Unfortunately, RPE 7 might be too easy for advanced athletes to get their best gains from. • Training to an RPE 10 is permissible, but it should be on rare occasions because of the very high levels of fatigue and potential for injury it generates. Page 42 STRENGTH TRAINING MADE SIMPLE 40 12. Beginner vs. Intermediate vs. Advanced Training 4. Train each movement pattern 2-3x per week across 5-10 ses- sions with twice-per-day sessions used in a phasic manner over the block. • Due to such high degrees of strength in some advanced athletes, they often can’t do too many sets in one session productively. BEGINNER ~0-3 YEARS TRAINING RECOMMENDED TRAINING STRATEGIES BY TRAINING STATUS INTERMEDIATE ~3-7 YEARS TRAINING ADVANCED ~7+ YEARS TRAINING MOSTLY 5-10 REPS PRIORITIZE COMPOUND BASICS FOCUS ON TECHNIQUE HARD, BUT NOT MAXIMAL TRAIN FULL BODY 3-4x A WEEK 5-10, 3-6, 1-3 REPS TROUBLESHOOT SFR RPE 7-10, FROM MEV TO MRV TRAIN EACH MOVEMENT 2-4x A WEEK ACROSS 4-6 SESSIONS MOSTLY 3-6 REPS, OCCASIONALLY 5-10 REPS FOCUS ON SFR MOSTLY RPE 8-9 TRAIN EACH MOVEMENT 2-3x A WEEK ACROSS 5-10 SESSIONS If you’re not sure which one you are, choose the less experienced of your two best choices and go from there Page 43 STRENGTH TRAINING MADE SIMPLE 41 13. HOW DO YOU PRIORITIZE SPECIFIC LIFTS? You may want to prioritize specific lifts for an additional increase in strength, but you must understand that such prioritization always results in a tradeoff between different lifts. When you focus intensely on one or several lifts at a time, you can certainly expect to improve your gains for those specific exercises, but the consequence is that you will inevitably make less progress (or even just maintain strength) among the exercises you are forced to place on the back burner. Unfortunately, there’s no way to magically maximize all of your lifts at the same time. That being said, if you’re willing to accept the pros and cons of specialization phases, here is the best way to do it in six concise points. 1. Firstly, do a hypercaloric hypertrophy phase for the supporting muscles of the movements you intend to isolate. Remember, the best way to improve your per- formance in the bench press is to grow bigger triceps and a bigger chest. 2. Train the prioritized lift (or the muscles that support it) more often, usually with one extra session per week more than usual. For",
  "example, if you normally squat 2x per week and you want to prioritize squats, try to reconfigure your program in a way that allows you to squat 3x per week. 3. Train other lifts (and muscle groups) with less volume. • This is especially relevant if the muscles are used heavily in both lifts. For example, if you want to increase your bench press, you might need Page 44 STRENGTH TRAINING MADE SIMPLE 42 13. How do you prioritize specific lifts to reduce your shoulder pressing volume since both of those movements heavily recruit the shoulders and the triceps. 4. Train the prioritized lift first in most of its weekly sessions. If you say you want to prioritize your deadlift, but you always train it after squatting, you have a conflict of interest. 5. Consider training it the hardest after each week’s days off. For example, if you always take Sundays off, it’s probably a good idea to train your movement of emphasis first (and hardest) on Mondays. 6. Choose the exercises that have the highest RSM. And, although you should cer- tainly consider the SFRs for these same movements, it’s probably best practice to prioritize exercises with the best RSMs and work around the resulting fatigue. In case that acronym is new to you, RSM stands for raw stimulus magnitude, and it represents only the stimulus portion of the SFR, not the fatigue portion. Thus, if deficit deadlifts really boost your deadlift but also result in an enormous amount of systemic fatigue, it makes good sense to keep them in if you’re prioritizing your deadlift, but you might have to lower your heavy squatting and overall posterior chain volume enough in other areas of your program to make room for them. Page 45 STRENGTH TRAINING MADE SIMPLE 43 14. PREVENTING AND MANAGING INJURIES As important as it is to be aware of injury prevention, you’ll never be able to make the gym a completely safe place to be. Steel is heavy and hard, and when it falls, sometimes people get hurt. But, you can reduce your chance of injury by implementing a few basic training ideas. Here are four of our best tips on how to do just that while training for strength. 4 TIPS FOR INJURY PREVENTION IN STRENGTH TRAINING Don’t be an idiot. ● Always be sure to warm up properly, and keep your technique clean. ● Avoid gym challenges and random heavy lifting. ● Don’t lift any loads you haven’t worked up to in a calculated, progressive manner. This point is huge! Tons of people have gotten hurt by reaching way beyond the loads they should have been lifting when all they needed to do was wait another several weeks of progression. Page 46 STRENGTH TRAINING MADE SIMPLE 44 14. Preventing and Managing Injuries Ramp up loads slowly. ● As you add weight to the bar from week to week, never add so much weight that you have to increase more than one point on the RPE scale from the week prior. In most cases, you will be going up by 5, 10, or 15 pounds. Don’t be silly and slap an extra 45 pounds on the bar because you “feel like it.” Being patient will notably reduce your injury risk. ● Don’t train with overlapping soreness often as training with microdamage may predispose you to injury. If you train with overlapping soreness on occasion, don’t add any more sets to the session you’re doing or to the one before its next week’s equivalent so that you’re not doing more when you already can’t recover from doing the current prescription. Pay attention. ● If some technique hurts your joints more and more with each rep or set, pause the set, rack the weight, reevaluate, and make adjustments if it continues. Page 47 STRENGTH TRAINING MADE SIMPLE 45 14. Preventing and Managing Injuries Deload maturely. ● Don’t skip the deload or cut it short! Deloads can be boring, but your body needs them to literally heal. Skipping or cutting a deload short is essentially asking for trouble. ● Don’t add work during your deload cause you’re itching to train. Deloads are supposed to be easy and low-volume. If your deload isn’t super easy, it’s not",
  "much of a deload. Instead, it’s just another week of hard training where your fatigue doesn’t really decline much in preparation for the next mesocycle. This will cause fatigue to accumulate much faster than anticipated in that next mesocycle, which will inevitably cause problems including (but not limited to) an increased risk of injury. Hopefully, you take all of this insight into account and never wind up getting hurt to the extent that your training quality and intensity is negatively impacted. But, because the nature of strength training is one of overload and pushing beyond your limits with increasingly heavy weights, injury for almost everyone at some point in the game is nearly inevitable. If and when you do get hurt, please give the following steps a look before you make your next move. As a bit of a bonus consideration, please remember that when you’ve injured a specific muscle or joint but still want to train other muscles, you have to make sure none of the other training bothers the injured area to any noticeable extent. In doing this, you will avoid continuously reaggravating the injury without letting it heal completely. Page 48 STRENGTH TRAINING MADE SIMPLE 46 14. Preventing and Managing Injuries 6 STEPS FOR INJURY MANAGEMENT IN STRENGTH TRAINING For the injured area itself: 1. See a medical professional and do all the surgery/rehab/time away they instruct. 2. When you’re cleared for activity, start with sets of 20-30 reps at 5-10 RIR and work on range of motion. You can end this phase of training when you can per- form the entire range of motion of the movement/joint pain-free 3. Once the injured area is pain-free in normal ranges of motion, work up to doing 3-0 RIR in just a handful of sets of 20-30 reps in several sessions across the week. Recently injured tissues have very poor volume tolerance, so doing a bit fewer sets (like 1-2 per session 2-3x per week) is better than doing more sets (like 3-4 sets per session 3-4x per week). 4. After this, add sets and cycle from MEV to MRV in the 20-30 rep range. This can be done once you’re very comfortably recovering from just a few sets of 20-30 reps. 5. Once you’ve spent some time training comfortably and pain-free in the higher rep ranges, slowly add load to some of those sets to get into the 10-20 rep range. Add load slowly and let the reps fall by two or so per session. In other words, don’t just jump from your 30RM to 10RM unless you want to get hurt again. 6. From here, keep slowly adding load, and eventually dip back into the 5-10 rep range. Once you’ve been able to train in that range effectively for a few weeks, take a deload and then proceed into your strength and peaking rep ranges as you see fit. Page 49 STRENGTH TRAINING MADE SIMPLE 47 14. Preventing and Managing Injuries INJURY OCCURS STEPS TO TAKE WHEN AN INJURY OCCURS SEEK MEDICAL HELP REHABILITATION SURGERY TIME AWAY CLEARED FOR ACTIVITY PAIN-FREE AND NORMAL ROM ADD SETS AND CYCLE FROM MEV TO MRV IN 20-30 REP RANGE SLOWLY ADD LOAD INTO THE 10-20 REP RANGE KEEP ADDING LOAD AND DIP INTO 5-10 REP RANGE DELOAD AND RESUME NORMAL TRAINING 3-0 RIR, 20-30 REP SETS WITHIN INJURED TISSUE This way, you’re not just continuously re-aggravating the injury and not letting it heal completely. Page 50 STRENGTH TRAINING MADE SIMPLE 48 15. MATCHING YOUR TRAINING TO YOUR DIET Diet is a big factor in how well your strength training improves your abilities, and making sure you’re dieting the right way for the phase of strength training you’re in can be a major contributor to your success. If you’re trying to gain muscle by eating in a caloric surplus, only do this during a hyper- trophy block. Otherwise, you’ll put on a needless amount of fat. If you’re dieting to lose fat and potentially enter a lower weight class, you’re best off doing this during your hypertrophy blocks as well. You can diet down during early strength phases in your strength blocks, but it’s highly recommended that you never exceed a rate of loss of",
  "greater than 0.5% body weight per week to minimize risking strength losses. If you diet down during such strength phases, make sure to also reduce your load pro- gressions from week to week by about half of their usual amounts so that you don’t accumulate too much fatigue and overreach prematurely. Weight loss dieting makes fatigue reduction way harder, and you have to take this into account! Think of it as driving in the snow. You either slow down so that you don’t swerve reck- lessly off the road, or you don’t slow down and wind up in a ditch or worse. The trip goes slower when you take the necessary precautions to account for the snow, but it goes faster than any alternate situation in which you drive off the road and waste time being stuck in a snowbank waiting for help. Page 51 STRENGTH TRAINING MADE SIMPLE 49 15. Matching Your Training to Your Diet Furthermore, if our analogous car flips and you get injured because you’ve been carrying excessive levels of fatigue from dieting while pushing loads too quickly in a strength phase, then you’ve got more problems than just a slightly delayed trip. In later phases in your strength block, you should be maintaining your weight, and you should nearly always maintain your weight during peaking phases to make sure you’re used to lifting in a body that has the same leverages over time and isn’t fatigued from weight loss dieting right at the point when fatigue reduction is most critically important. Yes, you can lose weight in the last days or hours of your meet prep by cutting water, but you should not be losing weight in the last weeks of meet prep by cutting calories. Page 52 STRENGTH TRAINING MADE SIMPLE 50 16. TROUBLESHOOTING LACK OF PROGRESS There could be many reasons you’re not seeing the strength gains you want or the gains you’re used to seeing. The most common reason is that you’re still expecting linear gains like you made when you were a beginner. But, because you’re more advanced, you should actually be expect- ing gains of diminishing returns. The second biggest reason you might not be getting the gains you want is simply genet- ics. Not all of us were built to bench press 500 pounds, which is certainly unfortunate, but it isn’t exactly a Shakespearean tragedy. That being said, if you’ve made peace with your training age and your genetics, there may be some additional factors to consider that could improve your rate of strength gains, especially if you’ve hit an unexplained plateau. 8 FACTORS FOR TROUBLESHOOTING A LACK OF STRENGTH IMPROVEMENT 1. Appropriate and consistent training and diet If you’re inconsistent, the inconsistency is the problem with your gains. You will only see your best gains when you’re able to piece together tidy sequences of completed workouts over weeks and months. Page 53 STRENGTH TRAINING MADE SIMPLE 51 16. Troubleshooting Lack of Progress 2. MEV to MRV training for each muscle group targeted For example, do you even know if you’re hitting your MRV at the end of your squat accumulation phases? If you’ve never taken your squat training volume high enough to stall squat strength out, you don’t actually know. They might benefit from much more volume than you’re currently training them with, and no amount of extra intensity will make up for that. You can do squat 1RMs until you’re blue in the face, but what you probably need is just more sets of 3-6 reps. Are these sets of 3-6 as exciting? Maybe not. But they are very effective in the long-term. If you feel as though you might be undertraining a lift, increase the number of sets every mesocycle of a block and pay attention to where your strength gains are best. Please remember that you find out the strength gains in the tested mesocycle by seeing how strong you are for reps in the mesocycle after it, not in the mesocycle itself. Only after a deload brings the fatigue down can you see if your experiment worked. On the other hand, you might be smashing your bench press with near-MRV or even above",
  "MRV volumes. In this case, you can reduce the amount of training you do for your pressing movements by one set per mesocycle in a given block and see at which volumes your rep strength goes up the most. You can use this process for any movement type, but you have to make sure that each movement type is completely accounted for. If you lower your bench pressing volume but raise your machine pressing volume at the same time, you’re not actually lowering your total pressing volumes. 3. Getting fatigue management in line If you’re not sleeping enough to be well-rested (7-9 hours), if high levels of stress are killing your energy levels, and if you don’t have regular times during most days and pretty much all weeks to unwind, you may not be gaining at your best rates. Rest and recovery are incredibly important when it comes to making your best strength gains. Page 54 STRENGTH TRAINING MADE SIMPLE 52 16. Troubleshooting Lack of Progress 4. Making sure your chosen exercises have high SFRs and high RSMs Don’t be the athlete who simply goes through the motions. If an exercise has a low SFR for you, try another one. Use movements that give you the best SFRs and the highest RSMs for really lagging muscle groups and movement types so that you know you’re using the best weapons for the battle. It would be strange to complain about lagging squat strength if you have yet to try increasing your hack squats for sets of 5-10 reps in your hypertrophy phase even though you get a Grady stimulus from hack squats. 5. Finding a stable technique for each lift that works best for your biggest numbers Some people prefer to bench press with a wider grip while others prefer to bench press with a narrower grip. Similarly, some people prefer sumo deadlifting, some conventional, and many others prefer various styles that seem to account for everything in between. Your technique doesn’t have to look like someone else’s, but it should feel best for you. As you practice it over time, you should become very comfortable with it, which is likely to lead to your best gains. Think of it this way. If you haven’t been progressing on a lift, what do you have to lose by experimenting with a slightly different technique? Strength regain is very easy compared to new gain, so at worst you’ll just be in the same spot after your experiment. At best, you’ll see improvements! 6. Being hypercaloric in gain phases and adding net bodyweight over months/ years To become the strongest version of yourself, you have to get more muscular. If you look at almost all of the champion lifters in most weight classes over history, they are mega-jacked! No, you might not have signed up explicitly for hypertrophy work when you chose to pursue strength training, but it’s undeniable that big muscles create big forces. So, if you want to get stronger, the most straightfor- ward way to do it by far is to add muscle size. Page 55 STRENGTH TRAINING MADE SIMPLE 53 16. Troubleshooting Lack of Progress Unless you’re already very lean for your weight class and you don’t want to move up, adding size is a very good idea in nearly every case for serious strength athletes. 7. Attending to training-side fatigue management Training manipulations that reduce cumulative fatigue such as deloads, active rests, and low-volume phases are critical in programming, especially when you’re no longer a beginner. A very common “instant PR” formula is to take a late beginner or early intermedi- ate and have them do a deload or active rest for the first time. In most cases, a few weeks later you’ll notice that they are making crazy strength gains. Weird, right? It’s almost as if bringing down fatigue is a good thing that potentiates further strength gains! 8. Making all the above changes for long enough It’s easy to say you tried the changes but they didn’t work if you only tried to implement them for a few days or even a few weeks. But, if you really want the best results, try implementing some of these trouble- shooting",
  "tips for months. At that point, it’s very likely that the gains will return! Unfortunately, too many people are simply unwilling to make this kind of tempo- rarily thankless commitment in order to set themselves up for future success. If you can resist that temptation, however, you’ll give yourself the chance to push your limits further than you ever have before. If you’d like to consume this guide in video form, you can do that via our Strength Made Simple series on YouTube. Strength Made Simple YouTube Series Wherever your fitness journey takes you, we wish you the very best, and we hope to have more and more resources with which to help you at every step along the way. See you next time!"
]